@brussell-kareo I can see there many changes:

```
15:27:35.192 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
15:27:35.192 STDOUT terraform:   ~ update in-place
15:27:35.192 STDOUT terraform: -/+ destroy and then create replacement
15:27:35.192 STDOUT terraform: OpenTofu will perform the following actions:
15:27:35.192 STDOUT terraform:   # module.nb-psc-l7xlb["envgroup-dev"].google_compute_backend_service.psc_backend will be updated in-place
15:27:35.192 STDOUT terraform:   ~ resource "google_compute_backend_service" "psc_backend" {
15:27:35.193 STDOUT terraform:       ~ connection_draining_timeout_sec = 0 -> 300
15:27:35.193 STDOUT terraform:         id                              = "projects/tebra-apigee-ef51/global/backendServices/apigee-x-bridge-envgroup-dev-xlb-psc-backend"
15:27:35.193 STDOUT terraform:       - locality_lb_policy              = "ROUND_ROBIN" -> null
15:27:35.193 STDOUT terraform:         name                            = "apigee-x-bridge-envgroup-dev-xlb-psc-backend"
15:27:35.193 STDOUT terraform:       ~ port_name                       = "http" -> "https"
15:27:35.193 STDOUT terraform:         # (15 unchanged attributes hidden)
15:27:35.193 STDOUT terraform:         # (2 unchanged blocks hidden)
15:27:35.193 STDOUT terraform:     }
15:27:35.193 STDOUT terraform:   # module.nb-psc-l7xlb["envgroup-dev"].google_compute_global_forwarding_rule.forwarding_rule will be updated in-place
15:27:35.193 STDOUT terraform:   ~ resource "google_compute_global_forwarding_rule" "forwarding_rule" {
15:27:35.193 STDOUT terraform:         id                    = "projects/tebra-apigee-ef51/global/forwardingRules/apigee-x-bridge-envgroup-dev-xlb-psc-fr"
15:27:35.193 STDOUT terraform:         name                  = "apigee-x-bridge-envgroup-dev-xlb-psc-fr"
15:27:35.193 STDOUT terraform:       ~ target                = "https://www.googleapis.com/compute/v1/projects/tebra-apigee-ef51/global/targetHttpsProxies/apigee-x-bridge-envgroup-dev-xlb-psc-proxy" -> (known after apply)
15:27:35.193 STDOUT terraform:         # (11 unchanged attributes hidden)
15:27:35.193 STDOUT terraform:     }
15:27:35.193 STDOUT terraform:   # module.nb-psc-l7xlb["envgroup-dev"].google_compute_target_https_proxy.https_proxy must be replaced
15:27:35.193 STDOUT terraform: -/+ resource "google_compute_target_https_proxy" "https_proxy" {
15:27:35.193 STDOUT terraform:       - certificate_manager_certificates = [] -> null
15:27:35.193 STDOUT terraform:       ~ creation_timestamp               = "2024-11-06T15:35:54.492-08:00" -> (known after apply)
15:27:35.193 STDOUT terraform:       - http_keep_alive_timeout_sec      = 300 -> null # forces replacement
15:27:35.193 STDOUT terraform:       ~ id                               = "projects/tebra-apigee-ef51/global/targetHttpsProxies/apigee-x-bridge-envgroup-dev-xlb-psc-proxy" -> (known after apply)
15:27:35.193 STDOUT terraform:         name                             = "apigee-x-bridge-envgroup-dev-xlb-psc-proxy"
15:27:35.193 STDOUT terraform:       ~ proxy_bind                       = false -> (known after apply)
15:27:35.193 STDOUT terraform:       ~ proxy_id                         = 360565445369414581 -> (known after apply)
15:27:35.193 STDOUT terraform:       ~ self_link                        = "https://www.googleapis.com/compute/v1/projects/tebra-apigee-ef51/global/targetHttpsProxies/apigee-x-bridge-envgroup-dev-xlb-psc-proxy" -> (known after apply)
15:27:35.193 STDOUT terraform:       ~ tls_early_data                   = "DISABLED" -> (known after apply)
15:27:35.193 STDOUT terraform:       ~ url_map                          = "https://www.googleapis.com/compute/v1/projects/tebra-apigee-ef51/global/urlMaps/apigee-x-bridge-envgroup-dev-xlb-psc" -> "projects/tebra-apigee-ef51/global/urlMaps/apigee-x-bridge-envgroup-dev-xlb-psc"
15:27:35.194 STDOUT terraform:         # (4 unchanged attributes hidden)
15:27:35.194 STDOUT terraform:     }
15:27:35.194 STDOUT terraform:   # module.nb-psc-l7xlb["envgroup-prod"].google_compute_backend_service.psc_backend will be updated in-place
15:27:35.194 STDOUT terraform:   ~ resource "google_compute_backend_service" "psc_backend" {
15:27:35.194 STDOUT terraform:       ~ connection_draining_timeout_sec = 0 -> 300
15:27:35.194 STDOUT terraform:         id                              = "projects/tebra-apigee-ef51/global/backendServices/apigee-x-bridge-envgroup-prod-xlb-psc-backend"
15:27:35.194 STDOUT terraform:       - locality_lb_policy              = "ROUND_ROBIN" -> null
15:27:35.194 STDOUT terraform:         name                            = "apigee-x-bridge-envgroup-prod-xlb-psc-backend"
15:27:35.194 STDOUT terraform:       ~ port_name                       = "http" -> "https"
15:27:35.194 STDOUT terraform:         # (15 unchanged attributes hidden)
15:27:35.194 STDOUT terraform:         # (2 unchanged blocks hidden)
15:27:35.194 STDOUT terraform:     }
15:27:35.194 STDOUT terraform:   # module.nb-psc-l7xlb["envgroup-prod"].google_compute_global_forwarding_rule.forwarding_rule will be updated in-place
15:27:35.194 STDOUT terraform:   ~ resource "google_compute_global_forwarding_rule" "forwarding_rule" {
15:27:35.194 STDOUT terraform:         id                    = "projects/tebra-apigee-ef51/global/forwardingRules/apigee-x-bridge-envgroup-prod-xlb-psc-fr"
15:27:35.194 STDOUT terraform:         name                  = "apigee-x-bridge-envgroup-prod-xlb-psc-fr"
15:27:35.194 STDOUT terraform:       ~ target                = "https://www.googleapis.com/compute/v1/projects/tebra-apigee-ef51/global/targetHttpsProxies/apigee-x-bridge-envgroup-prod-xlb-psc-proxy" -> (known after apply)
15:27:35.194 STDOUT terraform:         # (11 unchanged attributes hidden)
15:27:35.194 STDOUT terraform:     }


[skipped]

```
